* PANDAS

In [26]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [7]:
#Creating a series
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(arr)  #so can input either a numpy array or a python list

0    10
1    20
2    30
dtype: int32

In [5]:
pd.Series(data = my_data, index = labels) #Unlike a numpy arr,index can be labelled

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
#NumPy arrays can hold any data type,not int alone
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series(data = [sum,print,len]) #inbuilt fun can be stored too

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [18]:
ser1 = pd.Series([1,2,3,4],['USA','GERMANY','ITALY','RUSSIA'])
ser2 = pd.Series([1,2,3,4],['USA','GERMANY','POLAND','RUSSIA'])

In [19]:
ser1

USA        1
GERMANY    2
ITALY      3
RUSSIA     4
dtype: int64

In [20]:
ser2

USA        1
GERMANY    2
POLAND     3
RUSSIA     4
dtype: int64

In [22]:
ser1 + ser2  #converted to float to avaoi loss of data

GERMANY    4.0
ITALY      NaN
POLAND     NaN
RUSSIA     8.0
USA        2.0
dtype: float64

In [23]:
ser1['RUSSIA']

4

* DATA FRAMES

In [27]:
import numpy as np
import pandas as pd

In [28]:
from numpy.random import randn

In [29]:
np.random.seed(101) ##Data frame is a bunch of series datatype that share the same index

In [30]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'], ['W','X','Y','Z'])  #making the dataframe

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df['W']   #this is in series datatype format

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
type(df['W'])

pandas.core.series.Series

In [36]:
df[['W','Z']]   #this is a dataframe not a series

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [40]:
#creating new columns
df['new'] = df['W'] + df['Y']

In [43]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [45]:
df.drop('new',axis = 1)  #delete a column.For rows, axis = 0, for columns, axis = 1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df  #by default the inplace parameter of df.drop is False.So change is not retained

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [47]:
df.drop('new',axis = 1, inplace = True)

In [48]:
df #now its gone

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
#to delete rows: either put axis = 0, or leave it as default is 0
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [51]:
df.drop('C',axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df.shape

(5, 4)

In [54]:
#To select rows, 2 methods are present

In [57]:
df.loc['C'] #returns a series(index based location)

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [56]:
df.iloc[2] #numerical based location(C is in index 2)

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [58]:
df.loc['A','Z'] #selecting subsets of rows,columns

0.5038257538223936

In [59]:
df.loc[['A','B'],['W','X','Y']]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077

In [63]:
#Conditional selection
bool_df = df > 0

In [64]:
df[bool_df]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
#Shortcut
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [68]:
#To filter out rows
result_df = df[df['W'] > 0]

In [69]:
result_df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [74]:
#Shortcut
df[df['W'] > 0][['X','Y']] #stacking operations

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [75]:
df[(df['W']>0) & (df['Y']>1)] #Don't use and operator during multiple conditions as both df are a series of T/F and compiler gets confused

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df[(df['W']>0) | (df['Y']>1)] #or operation

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [78]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [79]:
newind = 'CA NY WY OR CO'.split()

In [80]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [81]:
df['States'] = newind

In [82]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [83]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

* MULTILEVEL INDEXING

In [133]:
import numpy as np
import pandas as pd

In [134]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [135]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [136]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [137]:
df  #multilevel / hierarchy index

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [138]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [147]:
df.index.names = ['Groups', 'Num']

In [148]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [149]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [150]:
#Crosssection of rows and columns
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [152]:
#Can skip a few rows and pick only those we need
#We need the rows with Num = 1
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [153]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [154]:
"""MISSING DATA"""

'MISSING DATA'

In [155]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [156]:
df = pd.DataFrame(d)

In [157]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [158]:
 df.dropna() #drops any row with null value

     A    B  C
0  1.0  5.0  1

In [159]:
df.dropna(axis = 1) #drops any column with null value

   C
0  1
1  2
2  3

In [160]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [161]:
df.dropna(thresh = 2) #row 1 and 2 have atleast 2 non NA values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [162]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [163]:
df.fillna(value = "NEW")  #Fills value with null in them

     A    B  C
0    1    5  1
1    2  NEW  2
2  NEW  NEW  3

In [166]:
#To fill NA with the mean of that particular column
df['A'].fillna(value = df['A'].mean(), inplace = True) #Just replacing the values for fun

In [167]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

* GROUPBY

In [168]:
import numpy as np
import pandas as pd

In [169]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales': [200,120,340,124,243,350]}

In [170]:
df = pd.DataFrame(data)

In [171]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [172]:
GrpbyComp = df.groupby('Company')

In [173]:
GrpbyComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [174]:
GrpbyComp.std() #Std deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [175]:
GrpbyComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [177]:
GrpbyComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [178]:
#Shortcut
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [179]:
df.groupby('Company').count() #counts the instances more examples: max,min

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [181]:
#To get a bunch of info
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [187]:
df.groupby('Company').describe().transpose()  #Changing format of printing

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [188]:
df.groupby('Company').describe().transpose() ['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [189]:
"""LEARN MERGING JOINING CONCATENATION IN PERIAN NOTEBOOK"""

'LEARN MERGING JOINING CONCATENATION IN PERIAN NOTEBOOK'

* OPERATIONS

In [190]:
import numpy as np
import pandas as pd

In [192]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2': [444,555,666,444],
                'col3':['abc','def','ghi','xyz']})

In [195]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [196]:
#Finding unique elements
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [197]:
df['col2'].nunique()

3

In [198]:
#which is same as
len(df['col2'].unique())

3

In [200]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [201]:
#To apply a user defined function to df instead of sum or count or mean etc
def times2(x):
    return x * 2

In [202]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [203]:
df['col3']

0    abc
1    def
2    ghi
3    xyz
Name: col3, dtype: object

In [204]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [207]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [208]:
df.drop('col1',axis = 1,) #Delete a column

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [209]:
df ##Put inplace = true to remove permanently

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [210]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [211]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [217]:
#df.sort_values('col2', axis = 0)
#df.sort_values(by = 'col2')
df.sort_values('col2') #All mean the same

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [219]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [220]:
#PIVOT TABLES
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [221]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [222]:
df.pivot_table(values = 'D',index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

* DATA INPUT - OUTPUT
* CSV
* Excel
* HTML
* SQL

In [1]:
pwd  #All excel etc files must be in same library

'C:\\Users\\Hariharan'

In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('example')

In [5]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df.to_csv('Output')
pd.read_csv('Output') #We dont want this unnamed column

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [12]:
df.to_csv('Output',index = False)
pd.read_csv('Output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [16]:
#Pandas can only import excel data,not formulas,macros,images
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [17]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

In [18]:
##READING FROM WEBPAGES
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [19]:
type(data)

list

In [21]:
#Finding the data frame we want usually, is in 0th index
data[0].head()  #Webscraping

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","December 19, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","December 19, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","December 19, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","December 19, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"

In [27]:
#Creating SQL Engine
from sqlalchemy import create_engine

In [28]:
engine = create_engine('sqlite:///:memory:') #Create a temporary small SQLite engine

In [33]:
df.to_sql('sql_tabl',engine)

In [34]:
sqldf = pd.read_sql('sql_tabl',con = engine)

In [35]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15